**Домашнее задание 2**

Во втором дз предлагается поработать с достаточно большим датасетом, [описание](https://archive.ics.uci.edu/ml/datasets/bank+marketing). Решите предложенные задания с использованием модуля Pandas (NumPy, разумеется, тоже разрешен).

Использование условий и циклов крайне нежелательно (списковые включения это тоже цикл!), за это будут снижаться баллы.
Все задания равноценны (кроме нулевой).
В каждой задаче постарайтесь придумать несколько решений. Решением должен быть Jupyter notebook / ссылка на Colab

In [1]:
import numpy as np
import pandas as pd

In [2]:
url = 'https://raw.githubusercontent.com/Sketchjar/MachineLearningHD/main/bank_marketing_dataset.csv'

df = pd.read_csv(url)

0. Каков размер датасета? Выведите первые 2 строки. Выведите две случайные строки. Какие типы колонок в датафрейме?

In [3]:
df.size

864948

In [4]:
df.shape

(41188, 21)

In [5]:
df.head(2)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [6]:
df.sample(2)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome
9769,40,housemaid,single,university.degree,no,no,no,telephone,jun,mon,...,3,999,0,nonexistent,1.4,94.465,-41.8,4.961,5228.1,no
16128,39,technician,married,professional.course,no,no,no,cellular,jul,tue,...,1,999,0,nonexistent,1.4,93.918,-42.7,4.961,5228.1,no

In [7]:
df.dtypes

age                 int64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
month              object
day_of_week        object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp.var.rate      float64
cons.price.idx    float64
cons.conf.idx     float64
euribor3m         float64
nr.employed       float64
outcome            object
dtype: object

1. Выведите основные статистические показатели для числовых признаков – количество значений, среднее, стандартное отклонение, min/max, медиану, верхнюю и нижнюю квартиль.

#### Способ 1

In [8]:
df.describe(include=[np.number])

,age,duration,campaign,pdays,previous,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed
count,41188.00000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000
mean,40.02406,258.285010,2.567593,962.475454,0.172963,0.081886,93.575664,-40.502600,3.621291,5167.035911
std,10.42125,259.279249,2.770014,186.910907,0.494901,1.570960,0.578840,4.628198,1.734447,72.251528
min,17.00000,0.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.634000,4963.600000
25%,32.00000,102.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.344000,5099.100000
50%,38.00000,180.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
75%,47.00000,319.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000
max,98.00000,4918.000000,56.000000,999.000000,7.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000

#### Способ 2

In [9]:
df.count(numeric_only=True)

age               41188
duration          41188
campaign          41188
pdays             41188
previous          41188
emp.var.rate      41188
cons.price.idx    41188
cons.conf.idx     41188
euribor3m         41188
nr.employed       41188
dtype: int64

In [10]:
df.mean(numeric_only=True)

age                 40.024060
duration           258.285010
campaign             2.567593
pdays              962.475454
previous             0.172963
emp.var.rate         0.081886
cons.price.idx      93.575664
cons.conf.idx      -40.502600
euribor3m            3.621291
nr.employed       5167.035911
dtype: float64

In [11]:
df.std(numeric_only=True)

age                10.421250
duration          259.279249
campaign            2.770014
pdays             186.910907
previous            0.494901
emp.var.rate        1.570960
cons.price.idx      0.578840
cons.conf.idx       4.628198
euribor3m           1.734447
nr.employed        72.251528
dtype: float64

In [12]:
df.min(numeric_only=True)

age                 17.000
duration             0.000
campaign             1.000
pdays                0.000
previous             0.000
emp.var.rate        -3.400
cons.price.idx      92.201
cons.conf.idx      -50.800
euribor3m            0.634
nr.employed       4963.600
dtype: float64

In [13]:
df.max(numeric_only=True)

age                 98.000
duration          4918.000
campaign            56.000
pdays              999.000
previous             7.000
emp.var.rate         1.400
cons.price.idx      94.767
cons.conf.idx      -26.900
euribor3m            5.045
nr.employed       5228.100
dtype: float64

In [14]:
df.median(numeric_only=True)

age                 38.000
duration           180.000
campaign             2.000
pdays              999.000
previous             0.000
emp.var.rate         1.100
cons.price.idx      93.749
cons.conf.idx      -41.800
euribor3m            4.857
nr.employed       5191.000
dtype: float64

In [15]:
df.quantile(q=0.25, numeric_only=True)

age                 32.000
duration           102.000
campaign             1.000
pdays              999.000
previous             0.000
emp.var.rate        -1.800
cons.price.idx      93.075
cons.conf.idx      -42.700
euribor3m            1.344
nr.employed       5099.100
Name: 0.25, dtype: float64

In [16]:
df.quantile(q=0.75, numeric_only=True)

age                 47.000
duration           319.000
campaign             3.000
pdays              999.000
previous             0.000
emp.var.rate         1.400
cons.price.idx      93.994
cons.conf.idx      -36.400
euribor3m            4.961
nr.employed       5228.100
Name: 0.75, dtype: float64

2. Выведите число значений, уникальных значений, самое частое из значений (и его частоту) для всех остальных признаков.

#### Способ 1

In [17]:
df.describe(include=[np.object0])

,job,marital,education,default,housing,loan,contact,month,day_of_week,poutcome,outcome
count,41188,41188,41188,41188,41188,41188,41188,41188,41188,41188,41188
unique,12,4,8,3,3,3,2,10,5,3,2
top,admin.,married,university.degree,no,yes,no,cellular,may,thu,nonexistent,no
freq,10422,24928,12168,32588,21576,33950,26144,13769,8623,35563,36548

#### Способ 2

In [18]:
df.select_dtypes(include=['object']).count()

job            41188
marital        41188
education      41188
default        41188
housing        41188
loan           41188
contact        41188
month          41188
day_of_week    41188
poutcome       41188
outcome        41188
dtype: int64

In [19]:
df.select_dtypes(include=['object']).nunique()

job            12
marital         4
education       8
default         3
housing         3
loan            3
contact         2
month          10
day_of_week     5
poutcome        3
outcome         2
dtype: int64

In [20]:
df.select_dtypes(include=['object']).mode()

,job,marital,education,default,housing,loan,contact,month,day_of_week,poutcome,outcome
0,admin.,married,university.degree,no,yes,no,cellular,may,thu,nonexistent,no

3. Сколько в выборке неграмотных людей? А безработных? Какой процент в выборке разведенных людей?

In [21]:
df[df.education == 'illiterate'].shape[0]

18

In [22]:
df[df['job'] == 'unemployed'].count()['job']

1014

In [23]:
df['marital'].value_counts()['divorced']/df['marital'].count()

0.11197436146450422

4. Вставьте вместо пропусков в колонку job самое частое значение в этой колонке

In [24]:
df['job'].isna().sum()

0

In [25]:
df['job'].value_counts()

admin.           10422
blue-collar       9254
technician        6743
services          3969
management        2924
retired           1720
entrepreneur      1456
self-employed     1421
housemaid         1060
unemployed        1014
student            875
unknown            330
Name: job, dtype: int64

In [26]:
df['job'].replace('unknown', df['job'].mode()[0], inplace=True)

In [27]:
df['job'].value_counts()

admin.           10752
blue-collar       9254
technician        6743
services          3969
management        2924
retired           1720
entrepreneur      1456
self-employed     1421
housemaid         1060
unemployed        1014
student            875
Name: job, dtype: int64

5. Сравните средний возраст женатых и одиноких людей

In [28]:
df['marital'].value_counts()

married     24928
single      11568
divorced     4612
unknown        80
Name: marital, dtype: int64

In [29]:
df[df['marital'] == 'married']['age'].mean()

42.30716463414634

In [30]:
# Если "одинокие" = "single" + 'divorced'
df[(df['marital'] == 'single') | (df['marital'] == 'divorced')]['age'].mean()

36.5053152039555

In [31]:
# Если "одинокие" = "single"
df[(df['marital'] == 'single')]['age'].mean()

33.15871369294606

6. Добавьте в датафрейм признак "логарифм длины последнего звонка". Для некоторых моделей машинного обучения могут быть полезны подобные признаки.

In [32]:
df['duration'].value_counts()

90      170
85      170
136     168
73      167
124     164
       ...
1569      1
1053      1
1263      1
1169      1
1868      1
Name: duration, Length: 1544, dtype: int64

In [33]:
df['log_duration'] = np.log(df['duration'], where=df['duration']!=0)
df[['duration', 'log_duration']].head(5)

   duration  log_duration
0       261      5.564520
1       149      5.003946
2       226      5.420535
3       151      5.017280
4       307      5.726848

7. Выведите часть датасета, в которой будут все люди с минимальным в выборке возрастом, согласившиеся на срочный вклад

In [34]:
df[(df['age'] == df['age'].min()) & (df['outcome'] == 'yes')]

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome,log_duration
37579,17,student,single,basic.9y,no,unknown,unknown,cellular,aug,fri,...,999,1,failure,-2.9,92.201,-31.4,0.869,5076.2,yes,6.21060
38274,17,student,single,unknown,no,no,yes,cellular,oct,tue,...,2,2,success,-3.4,92.431,-26.9,0.742,5017.5,yes,6.79794

8. Создайте новый датафрейм, в который войдут 10 самых возрастных клиентов, которые работают. В нем строки должны быть отсортированы по возрасту в порядке убывания, а индексом должны являться числа от 0 до 9 включительно. Оставьте в новом датафрейме (помимо индекса) только колонки age, marital education, housing, loan

In [35]:
df['job'].value_counts()

admin.           10752
blue-collar       9254
technician        6743
services          3969
management        2924
retired           1720
entrepreneur      1456
self-employed     1421
housemaid         1060
unemployed        1014
student            875
Name: job, dtype: int64

In [36]:
# отсортированные по возрасту клиенты в порядке убывания, которые работают (не unemployed, не retired, не student)
df2 = df[(df['job'] != 'unemployed') & (df['job'] != 'retired') & (df['job'] != 'student')].sort_values(by='age', ascending=False)
# 10 самых возрастных клиентов + переиндексация
df2 = df2.iloc[:10].reset_index()
df2

,index,age,job,marital,education,default,housing,loan,contact,month,...,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome,log_duration
0,38326,85,housemaid,divorced,basic.4y,unknown,yes,no,telephone,oct,...,999,0,nonexistent,-3.4,92.431,-26.9,0.739,5017.5,no,5.198497
1,39475,85,housemaid,married,basic.4y,unknown,no,no,cellular,apr,...,6,1,success,-1.8,93.749,-34.6,0.642,5008.7,yes,5.164786
2,39476,85,housemaid,married,basic.4y,unknown,yes,no,cellular,apr,...,6,2,success,-1.8,93.749,-34.6,0.642,5008.7,yes,5.117994
3,39477,85,housemaid,married,basic.4y,unknown,no,no,cellular,apr,...,999,0,nonexistent,-1.8,93.749,-34.6,0.642,5008.7,no,5.111988
4,39479,85,housemaid,married,basic.4y,unknown,yes,no,cellular,apr,...,999,1,failure,-1.8,93.749,-34.6,0.642,5008.7,yes,6.135565
5,40045,83,housemaid,divorced,basic.4y,no,yes,yes,cellular,jul,...,999,3,failure,-1.7,94.215,-40.3,0.797,4991.6,no,5.549076
6,40050,83,housemaid,divorced,basic.4y,no,yes,no,cellular,jul,...,3,1,success,-1.7,94.215,-40.3,0.797,4991.6,yes,6.502790
7,39411,82,housemaid,divorced,basic.4y,no,unknown,unknown,cellular,apr,...,999,0,nonexistent,-1.8,93.749,-34.6,0.638,5008.7,yes,4.934474
8,40716,82,housemaid,married,basic.4y,no,no,no,telephone,sep,...,3,2,success,-1.1,94.199,-37.5,0.877,4963.6,yes,5.631212
9,40218,82,housemaid,divorced,basic.4y,no,no,no,cellular,jul,...,999,0,nonexistent,-1.7,94.215,-40.3,0.881,4991.6,yes,5.755742

9. Создайте столбец с датой контакта. Дата должна соответствовать информации из столбцов month и day_of_week и относиться к 2021 году (в этом задании может быть, разумеется, много верных ответов, выведите любой)

In [37]:
m = pd.to_datetime(df['month'], format='%b').dt.strftime('%-m')

In [38]:
# Не очень понимаю, почему такая конструкция для дней недели не работает pd.to_datetime(df['day_of_week'], format="%a").dt.strftime('%w')
df['day_of_week'] = df['day_of_week'].apply(lambda x: x.capitalize())
df['day_of_week'] = df['day_of_week'].replace({"Mon": 0, "Tue": 1, "Wed": 2, "Thu": 3, "Fri": 4, "Sat": 5, "Sun": 6})

In [40]:
# 7 день месяца
d1 = pd.to_datetime(dict(year=2021, month=m, day=7))
# день недели 7 дня месяца
d2 = pd.to_datetime(dict(year=2021, month=m, day=7)).dt.weekday
# Дата понедельника в этом месяце
d1 = d1 - pd.to_timedelta(d2,'D')
# Дата соответствующего дня недели
df['content_date'] = d1 + pd.to_timedelta(df['day_of_week'],'D')

10. Какие два столбца исходного датафрейма наиболее скоррелированные?

In [41]:
df.corr().abs()

,age,day_of_week,duration,campaign,pdays,previous,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,log_duration
age,1.000000,0.018486,0.000866,0.004594,0.034369,0.024365,0.000371,0.000857,0.129372,0.010767,0.017725,0.008698
day_of_week,0.018486,1.000000,0.010549,0.015098,0.006765,0.004013,0.004401,0.004586,0.000099,0.005552,0.000734,0.016341
duration,0.000866,0.010549,1.000000,0.071699,0.047577,0.020640,0.027968,0.005312,0.008173,0.032897,0.044703,0.810247
campaign,0.004594,0.015098,0.071699,1.000000,0.052584,0.079141,0.150754,0.127836,0.013733,0.135133,0.144095,0.194935
pdays,0.034369,0.006765,0.047577,0.052584,1.000000,0.587514,0.271004,0.078889,0.091342,0.296899,0.372605,0.076283
previous,0.024365,0.004013,0.020640,0.079141,0.587514,1.000000,0.420489,0.203130,0.050936,0.454494,0.501333,0.048635
emp.var.rate,0.000371,0.004401,0.027968,0.150754,0.271004,0.420489,1.000000,0.775334,0.196041,0.972245,0.906970,0.043515
cons.price.idx,0.000857,0.004586,0.005312,0.127836,0.078889,0.203130,0.775334,1.000000,0.058986,0.688230,0.522034,0.009668
cons.conf.idx,0.129372,0.000099,0.008173,0.013733,0.091342,0.050936,0.196041,0.058986,1.000000,0.277686,0.100513,0.027704
euribor3m,0.010767,0.005552,0.032897,0.135133,0.296899,0.454494,0.972245,0.688230,0.277686,1.000000,0.945154,0.044609
nr.employed,0.017725,0.000734,0.044703,0.144095,0.372605,0.501333,0.906970,0.522034,0.100513,0.945154,1.000000,0.065514
log_duration,0.008698,0.016341,0.810247,0.194935,0.076283,0.048635,0.043515,0.009668,0.027704,0.044609,0.065514,1.000000

In [42]:
df.corr().abs().unstack().drop_duplicates().sort_values(ascending=False)[1:2]

emp.var.rate  euribor3m    0.972245
dtype: float64